Revit 2026 API

# ScheduleSortGroupFieldShowBlankLine Property

---

Indicates if an empty row should be displayed between groups.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ShowBlankLine { get; set; }
```
```vb
Public Property ShowBlankLine As Boolean
	Get
	Set
```
```cpp
public:
property bool ShowBlankLine {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ShowBlankLine : bool with get, set
```

#### Property Value

Boolean

True if an empty row should be displayed, false otherwise.

#### Reference

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace